class keyword():

    def __init__(self):
        pass

    def getSymptoms(self):
        symptoms = ['发烧','乏力','干咳','咳嗽','鼻塞','肺炎','腹泻','呼吸困难','咽痛']
        return symptoms[8]

    # 地区
    def getregion(self):
        cities = ['北京X', '天津X', '河北X', '山西X', '内蒙古X', '辽宁X', '吉林X', '黑龙江X', '上海X', '江苏X', '浙江X', '安徽X', '福建X', '江西X', '山东X', '河南X',
         '湖北X', '湖南X', '广东X', '广西X', '海南X', '重庆X', '四川X', '贵州X', '云南X', '西藏X', '陕西X', '甘肃X', '青海X', '宁夏X', '新疆X', '台湾X',
         '香港X', '澳门X', '其他X']
        regions = [11, 12, 13, 14, 15, 21, 22, 23, 31, 32, 33, 34, 35, 36, 37, 41, 42, 43, 44, 45, 46, 50, 51, 52, 53, 54, 61, 62, 63,
         64, 65, 71, 81, 82, 100]
        return regions

    def getsubregion(self):
        subregions ={11: ['北京~东城区X', '北京~西城区X', '北京~崇文区X', '北京~宣武区X', '北京~朝阳区X', '北京~丰台区X', '北京~石景山区X', '北京~海淀区X', '北京~门头沟区X', '北京~房山区X', '北京~通州区X', '北京~顺义区X', '北京~昌平区X', '北京~大兴区X', '北京~怀柔区X', '北京~平谷区X', '北京~密云县X', '北京~延庆县X'], 12: ['天津~和平区X', '天津~河东区X', '天津~河西区X', '天津~南开区X', '天津~河北区X', '天津~红桥区X', '天津~塘沽区X', '天津~汉沽区X', '天津~大港区X', '天津~东丽区X', '天津~西青区X', '天津~津南区X', '天津~北辰区X', '天津~武清区X', '天津~宝坻区X', '天津~宁河县X', '天津~静海县X', '天津~蓟县X', '天津~滨海新区X', '天津~保税区X'], 13: ['河北~石家庄X', '河北~唐山X', '河北~秦皇岛X', '河北~邯郸X', '河北~邢台X', '河北~保定X', '河北~张家口X', '河北~承德X', '河北~沧州X', '河北~廊坊X', '河北~衡水X'], 14: ['山西~太原X', '山西~大同X', '山西~阳泉X', '山西~长治X', '山西~晋城X', '山西~朔州X', '山西~晋中X', '山西~运城X', '山西~忻州X', '山西~临汾X', '山西~吕梁X'], 15: ['内蒙古~呼和浩特X', '内蒙古~包头X', '内蒙古~乌海X', '内蒙古~赤峰X', '内蒙古~通辽X', '内蒙古~鄂尔多斯X', '内蒙古~呼伦贝尔X', '内蒙古~兴安盟X', '内蒙古~锡林郭勒盟X', '内蒙古~乌兰察布盟X', '内蒙古~巴彦淖尔盟X', '内蒙古~阿拉善盟X'], 21: ['辽宁~沈阳X', '辽宁~大连X', '辽宁~鞍山X', '辽宁~抚顺X', '辽宁~本溪X', '辽宁~丹东X', '辽宁~锦州X', '辽宁~营口X', '辽宁~阜新X', '辽宁~辽阳X', '辽宁~盘锦X', '辽宁~铁岭X', '辽宁~朝阳X', '辽宁~葫芦岛X'], 22: ['吉林~长春X', '吉林~吉林X', '吉林~四平X', '吉林~辽源X', '吉林~通化X', '吉林~白山X', '吉林~松原X', '吉林~白城X', '吉林~延边朝鲜族自治州X'], 23: ['黑龙江~哈尔滨X', '黑龙江~齐齐哈尔X', '黑龙江~鸡西X', '黑龙江~鹤岗X', '黑龙江~双鸭山X', '黑龙江~大庆X', '黑龙江~伊春X', '黑龙江~佳木斯X', '黑龙江~七台河X', '黑龙江~牡丹江X', '黑龙江~黑河X', '黑龙江~绥化X', '黑龙江~大兴安岭X'], 31: ['上海~黄浦区X', '上海~卢湾区X', '上海~徐汇区X', '上海~长宁区X', '上海~静安区X', '上海~普陀区X', '上海~闸北区X', '上海~虹口区X', '上海~杨浦区X', '上海~闵行区X', '上海~宝山区X', '上海~嘉定区X', '上海~浦东新区X', '上海~金山区X', '上海~松江区X', '上海~青浦区X', '上海~南汇区X', '上海~奉贤区X','上海~崇明县X'], 32: ['江苏~南京X', '江苏~无锡X', '江苏~徐州X', '江苏~常州X', '江苏~苏州X', '江苏~南通X', '江苏~连云港X', '江苏~淮安X', '江苏~盐城X', '江苏~扬州X', '江苏~镇江X', '江苏~泰州X', '江苏~宿迁X'], 33: ['浙江~杭州X', '浙江~宁波X', '浙江~温州X', '浙江~嘉兴X', '浙江~湖州X', '浙江~绍兴X', '浙江~金华X', '浙江~衢州X', '浙江~舟山X', '浙江~台州X', '浙江~丽水X'], 34: ['安徽~合肥X', '安徽~芜湖X', '安徽~蚌埠X', '安徽~淮南X', '安徽~马鞍山X', '安徽~淮北X', '安徽~铜陵X', '安徽~安庆X', '安徽~黄山X', '安徽~滁州X', '安徽~阜阳X', '安徽~宿州X', '安徽~巢湖X', '安徽~六安X', '安徽~亳州X', '安徽~池州X', '安徽~宣城X'], 35: ['福建~福州X', '福建~厦门X', '福建~莆田X', '福建~三明X', '福建~泉州X', '福建~漳州X', '福建~南平X', '福建~龙岩X', '福建~宁德X'], 36: ['江西~南昌X', '江西~景德镇X', '江西~萍乡X', '江西~九江X', '江西~新余X', '江西~鹰潭X', '江西~赣州X', '江西~吉安X', '江西~宜春X', '江西~抚州X', '江西~上饶X'], 37: ['山东~济南X', '山东~青岛X', '山东~淄博X', '山东~枣庄X', '山东~东营X', '山东~烟台X', '山东~潍坊X', '山东~济宁X', '山东~泰安X', '山东~威海X', '山东~日照X', '山东~莱芜X', '山东~临沂X', '山东~德州X', '山东~聊城X', '山东~滨州X', '山东~菏泽X'], 41: ['河南~郑州X', '河南~开封X', '河南~洛阳X', '河南~平顶山X', '河南~安阳X', '河南~鹤壁X', '河南~新乡X', '河南~焦作X', '河南~濮阳X', '河南~许昌X', '河南~漯河X', '河南~三门峡X', '河南~南阳X', '河南~商丘X', '河南~信阳X', '河南~周口X', '河南~驻马店X'], 42: ['湖北~武汉X', '湖北~黄石X', '湖北~十堰X', '湖北~宜昌X', '湖北~襄阳X', '湖北~鄂州X', '湖北~荆门X', '湖北~孝感X', '湖北~荆州X', '湖北~黄冈X', '湖北~咸宁X', '湖北~随州X', '湖北~恩施土家族苗族自治州X', '湖北~仙桃X','湖北~潜江X', '湖北~天门X', '湖北~神农架X'], 43: ['湖南~长沙X', '湖南~株洲X', '湖南~湘潭X', '湖南~衡阳X', '湖南~邵阳X', '湖南~岳阳X', '湖南~常德X', '湖南~张家界X', '湖南~益阳X', '湖南~郴州X', '湖南~永州X', '湖南~怀化X', '湖南~娄底X','湖南~湘西土家族苗族自治州X'], 44: ['广东~广州X', '广东~韶关X', '广东~深圳X', '广东~珠海X', '广东~汕头X', '广东~佛山X', '广东~江门X', '广东~湛江X', '广东~茂名X', '广东~肇庆X', '广东~惠州X', '广东~梅州X', '广东~汕尾X', '广东~河源X', '广东~阳江X', '广东~清远X', '广东~东莞X', '广东~中山X'], 45: ['广西~南宁X', '广西~柳州X', '广西~桂林X', '广西~梧州X', '广西~北海X', '广西~防城港X', '广西~钦州X', '广西~贵港X', '广西~玉林X', '广西~百色X', '广西~贺州X', '广西~河池X', '广西~南宁X', '广西~柳州X'], 46: ['海南~海口X', '海南~三亚X'], 50: ['重庆~万州区X', '重庆~涪陵区X', '重庆~渝中区X', '重庆~大渡口区X', '重庆~江北区X', '重庆~沙坪坝区X', '重庆~九龙坡区X', '重庆~南岸区X', '重庆~北碚区X', '重庆~万盛区X', '重庆~双桥区X', '重庆~渝北区X', '重庆~巴南区X', '重庆~黔江区X', '重庆~长寿区X', '重庆~綦江县X', '重庆~潼南县X', '重庆~铜梁县X', '重庆~大足县X', '重庆~荣昌县X', '重庆~璧山县X', '重庆~梁平县X', '重庆~城口县X','重庆~丰都县X', '重庆~垫江县X', '重庆~武隆县X', '重庆~忠县X', '重庆~开县X', '重庆~云阳县X', '重庆~奉节县X', '重庆~巫山县X', '重庆~巫溪县X', '重庆~石柱土家族自治县X', '重庆~秀山土家族苗族自治县X', '重庆~酉阳土家族苗族自治县X', '重庆~彭水苗族土家族自治县X'], 51: ['四川~成都X', '四川~自贡X', '四川~攀枝花X', '四川~泸州X', '四川~德阳X', '四川~绵阳X', '四川~广元X', '四川~遂宁X', '四川~内江X', '四川~乐山X', '四川~南充X', '四川~眉山X', '四川~宜宾X', '四川~广安X', '四川~达州X', '四川~雅安X', '四川~巴中X', '四川~资阳X','四川~阿坝X', '四川~甘孜X', '四川~凉山X'], 52: ['贵州~贵阳X', '贵州~六盘水X', '贵州~遵义X', '贵州~安顺X', '贵州~铜仁X', '贵州~黔西南X', '贵州~毕节X', '贵州~黔东南X', '贵州~黔南X'], 53: ['云南~昆明X', '云南~曲靖X', '云南~玉溪X', '云南~保山X', '云南~昭通X', '云南~楚雄X', '云南~红河X', '云南~文山X', '云南~思茅X', '云南~西双版纳X', '云南~大理X','云南~德宏X', '云南~丽江X', '云南~怒江X', '云南~迪庆X', '云南~临沧X'], 54: ['西藏~拉萨X', '西藏~昌都X', '西藏~山南X', '西藏~日喀则X', '西藏~那曲X', '西藏~阿里X', '西藏~林芝X'], 61: ['陕西~西安X', '陕西~铜川X', '陕西~宝鸡X', '陕西~咸阳X', '陕西~渭南X', '陕西~延安X', '陕西~汉中X', '陕西~榆林X', '陕西~安康X', '陕西~商洛X'], 62: ['甘肃~兰州X', '甘肃~嘉峪关X', '甘肃~金昌X', '甘肃~白银X', '甘肃~天水X', '甘肃~武威X', '甘肃~张掖X', '甘肃~平凉X', '甘肃~酒泉X', '甘肃~庆阳X', '甘肃~定西X', '甘肃~陇南X', '甘肃~临夏X','甘肃~甘南X'], 63: ['青海~西宁X', '青海~海东X', '青海~海北X', '青海~黄南X', '青海~海南X', '青海~果洛X', '青海~玉树X', '青海~海西X'], 64: ['宁夏~银川X', '宁夏~石嘴山X', '宁夏~吴忠X', '宁夏~固原X'], 65: ['新疆~乌鲁木齐X', '新疆~克拉玛依X', '新疆~吐鲁番X', '新疆~哈密X', '新疆~昌吉X', '新疆~博尔塔拉X', '新疆~巴音郭楞X', '新疆~阿克苏X','新疆~克孜勒苏X', '新疆~喀什X', '新疆~和田X', '新疆~伊犁X', '新疆~塔城X', '新疆~阿勒泰X', '新疆~石河子X'], 71: ['台湾~台北市X', '台湾~高雄市X', '台湾~基隆市X', '台湾~台中市X', '台湾~台南市X', '台湾~新竹市X', '台湾~嘉义市X', '台湾~台北县X', '台湾~宜兰县X', '台湾~桃园县X', '台湾~新竹县X', '台湾~苗栗县X', '台湾~台中县X', '台湾~彰化县X', '台湾~南投县X', '台湾~云林县X', '台湾~嘉义县X', '台湾~台南县X', '台湾~高雄县X', '台湾~屏东县X', '台湾~澎湖县X', '台湾~台东县X', '台湾~花莲县X'], 81: ['香港~其他X', '香港~中西区X', '香港~东区X', '香港~九龙城区X', '香港~观塘区X', '香港~南区X', '香港~深水埗区X', '香港~黄大仙区X', '香港~湾仔区X', '香港~油尖旺区X', '香港~离岛区X', '香港~葵青区X', '香港~北区X', '香港~西贡区X', '香港~沙田区X', '香港~屯门区X', '香港~大埔区X', '香港~荃湾区X', '香港~元朗区X'], 82: ['澳门~其他X', '澳门~花地玛堂区X', '澳门~圣安多尼堂区X', '澳门~大堂区X', '澳门~望德堂区X', '澳门~风顺堂区X', '澳门~氹仔X', '澳门~路环X'], 100: []}
        subindex = {11: [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 28, 29], 12: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 21, 23, 25, 26, 27], 13: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], 14: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 23], 15: [1, 2, 3, 4, 5, 6, 7, 22, 25, 26, 28, 29], 21: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], 22: [1, 2, 3, 4, 5, 6, 7, 8, 24], 23: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 27], 31: [1, 3, 4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 15, 16, 17, 18, 19, 20,30], 32: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], 33: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], 34: [1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18], 35: [1, 2, 3, 4, 5, 6, 7, 8, 9], 36: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], 37: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17], 41: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17], 42: [1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 28, 29,30,31,32], 43: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,31], 44: [1, 2, 3, 4, 5, 6, 7, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19, 20], 45: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 21, 22], 46: [1, 2], 50: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 22, 23, 24, 25, 26, 27, 28, 29,30, 31, 32, 33, 34, 35, 36, 37, 38, 40, 41, 42, 43], 51: [1, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20,32,33,34], 52: [1, 2, 3, 4, 22, 23, 24, 26, 27], 53: [1, 3, 4, 5, 6, 23, 25, 26, 27, 28, 29,31, 32, 33, 34, 35], 54: [1, 21, 22, 23, 24, 25, 26], 61: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 62: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 24, 26, 29,30], 63: [1, 21, 22, 23, 25, 26, 27, 28], 64: [1, 2, 3, 4], 65: [1, 2, 21, 22, 23, 27, 28, 29,30, 31, 32, 40, 42, 43, 44], 71: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23], 81: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19], 82: [1, 2, 3, 4, 5, 6, 7, 8], 100: []}
        return subindex
    def gett_(self,y,m,d):
        y = str(y)
        if m < 10:
            m = '0' + str(m)
        else:
            m = str(m)

        if d+1 <10:
            ed = '0' + str(d+1)
        else:
            ed = str(d+1)

        if d <10:
            d = '0' + str(d)
        else:
            d = str(d)

        eh = '00'
        h = '23'

        ts = y + '-' + m +'-' + d +'-' + h
        te = y +'-' + m +'-' + ed +'-' + eh
        return ts,te


    def gett(self,y,m,d,h,g):
        eh = h + g
        ed = d
        em = m
        ey = y

        if eh < 10:
            eh = '0' + str(h + g)
        elif eh > 23:
            ed = d + 1
            eh = '00'
        else:
            eh = str(eh)

        if h < 10:
            h = '0' + str(h)
        else:
            h = str(h)

        if ed < 10:
            ed = '0' + str(ed)
        else:
            ed = str(ed)

        if d < 10:
            d = '0' + str(d)
        else:
            d = str(d)

        if m < 10:
            m = '0' + str(m)
        else:
            m = str(m)

        y = str(y)

        ts = y + '-' + m +'-' + d +'-' + h
        te = y +'-' + m +'-' + ed +'-' + eh
        return ts,te


# regions = keyword()